# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [3]:
a = pd.Series(lst,range(len(lst)))
a

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [4]:
a[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [5]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]
len(b)

10

In [6]:
df_b = pd.DataFrame(b,range(len(b)))
df_b

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [8]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [9]:
df_b.columns = colnames
df_b

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [19]:
df_b_subset = df_b[['Score_1','Score_3','Score_5']]
df_b_subset

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [16]:
average_Score_3 = df_b['Score_3'].mean()
average_Score_3

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [18]:
max_Score_4 = df_b['Score_4'].max()
max_Score_4

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [20]:
median_Score_2 = df_b['Score_2'].median()
median_Score_2

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [22]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}
orders

{'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [28]:
list(orders.keys())

['Description', 'Quantity', 'UnitPrice', 'Revenue']

In [33]:
df_orders = pd.DataFrame( orders )
df_orders

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [38]:
total_quantity_ordered = df_orders['Quantity'].sum()
total_quantity_ordered

2978

In [37]:
total_revenue_ordered = df_orders['Revenue'].sum()
total_revenue_ordered

637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [39]:
most_expensive = df_orders['UnitPrice'].max()
most_expensive

11.95

In [40]:
least_expensive = df_orders['UnitPrice'].min()
least_expensive

0.18

In [41]:
print(most_expensive - least_expensive)

11.77

## Let's load another dataset for more exercisesº

In [42]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [43]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [46]:
admissions.shape

(385, 9)

In [45]:
admissions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         385 non-null    int64
 1   GRE Score          385 non-null    int64
 2   TOEFL Score        385 non-null    int64
 3   University Rating  385 non-null    int64
 4   SOP                385 non-null    float64
 5   LOR                385 non-null    float64
 6   CGPA               385 non-null    float64
 7   Research           385 non-null    int64
 8   Chance of Admit    385 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 27.2 KB

In [50]:
admissions.describe().T

,count,mean,std,min,25%,50%,75%,max
Serial No.,385.0,193.000000,111.284171,1.00,97.00,193.00,289.00,385.00
GRE Score,385.0,316.732468,11.559115,290.00,308.00,317.00,325.00,340.00
TOEFL Score,385.0,107.387013,6.121456,92.00,103.00,107.00,112.00,120.00
University Rating,385.0,3.070130,1.144628,1.00,2.00,3.00,4.00,5.00
SOP,385.0,3.376623,1.007640,1.00,2.50,3.50,4.00,5.00
LOR,385.0,3.431169,0.896936,1.00,3.00,3.50,4.00,5.00
CGPA,385.0,8.597091,0.602385,6.80,8.16,8.62,9.07,9.92
Research,385.0,0.548052,0.498333,0.00,0.00,1.00,1.00,1.00
Chance of Admit,385.0,0.723922,0.144027,0.34,0.64,0.73,0.83,0.97

In [53]:
admissions.isna().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [64]:
admissions_indexed = admissions.set_index('Serial No.',append=True)
admissions_indexed

,,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
,Serial No.,,,,,,,,
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82
381,382,325,107,3,3.0,3.5,9.11,1,0.84
382,383,330,116,4,5.0,4.5,9.45,1,0.91
383,384,312,103,3,3.5,4.0,8.78,0,0.67
384,385,333,117,4,5.0,4.0,9.66,1,0.95

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [76]:
len(admissions_indexed['GRE Score'].unique()) == len(admissions_indexed)

False

In [77]:
len(admissions_indexed['CGPA'].unique()) == len(admissions_indexed)

False

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [92]:
admissions_indexed['Research'].unique()

array([1, 0])

In [95]:
len(admissions_indexed[ (admissions_indexed['CGPA'] > 9) & (admissions_indexed['Research'] == 1) ])

101

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [96]:
admissions_indexed['SOP'].unique()

array([4.5, 3. , 3.5, 2. , 4. , 5. , 1.5, 1. , 2.5])

In [97]:
len(admissions_indexed[ (admissions_indexed['CGPA'] > 9) & (admissions_indexed['SOP'] < 3.5) ])

5

In [98]:
admissions_indexed[ (admissions_indexed['CGPA'] > 9) & (admissions_indexed['SOP'] < 3.5) ]

,,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
,Serial No.,,,,,,,,
28,29,338,118,4,3.0,4.5,9.40,1,0.91
62,63,327,114,3,3.0,3.0,9.02,0,0.61
140,141,326,114,3,3.0,3.0,9.11,1,0.83
217,218,324,111,4,3.0,3.0,9.01,1,0.82
381,382,325,107,3,3.0,3.5,9.11,1,0.84

In [99]:
admissions_indexed[ (admissions_indexed['CGPA'] > 9) & (admissions_indexed['SOP'] < 3.5) ]['Chance of Admit'].mean()

0.8019999999999999

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [103]:
def toefl_over_100(x) :
    if x > 100 :
        return True
    else :
        return False

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [131]:
admissions_indexed['Decision'] = admissions_indexed['TOEFL Score'].apply(toefl_over_100) 
admissions_indexed

,,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision
,Serial No.,,,,,,,,,
0,1,337,118,4,4.5,4.5,9.65,1,0.92,True
1,2,316,104,3,3.0,3.5,8.00,1,0.72,True
2,3,322,110,3,3.5,2.5,8.67,1,0.80,True
3,4,314,103,2,2.0,3.0,8.21,0,0.65,True
4,5,330,115,5,4.5,3.0,9.34,1,0.90,True
...,...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82,True
381,382,325,107,3,3.0,3.5,9.11,1,0.84,True
382,383,330,116,4,5.0,4.5,9.45,1,0.91,True
383,384,312,103,3,3.5,4.0,8.78,0,0.67,True
384,385,333,117,4,5.0,4.0,9.66,1,0.95,True

In [129]:
admissions_indexed['Decision'].groupby(admissions_indexed['TOEFL_over_100']).count()

TOEFL_over_100
False     62
True     323
Name: Decision, dtype: int64

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [146]:
admissions_indexed['Decision2'] = np.where( admissions_indexed['SOP'] > 3 , 1 , 0) 
admissions_indexed

,,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision,Decision2
,Serial No.,,,,,,,,,,
0,1,337,118,4,4.5,4.5,9.65,1,0.92,True,1
1,2,316,104,3,3.0,3.5,8.00,1,0.72,True,0
2,3,322,110,3,3.5,2.5,8.67,1,0.80,True,1
3,4,314,103,2,2.0,3.0,8.21,0,0.65,True,0
4,5,330,115,5,4.5,3.0,9.34,1,0.90,True,1
...,...,...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82,True,1
381,382,325,107,3,3.0,3.5,9.11,1,0.84,True,0
382,383,330,116,4,5.0,4.5,9.45,1,0.91,True,1
383,384,312,103,3,3.5,4.0,8.78,0,0.67,True,1
384,385,333,117,4,5.0,4.0,9.66,1,0.95,True,1